Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=619_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Minä olen 20-vuotias nuori naisen alku Ivalosta.
sme: Mun lean 20-jahkásaš nuorra nieida Avvilis.

source: Minulla on vahvat juuret Ivaloon ja Inarin kuntaan, jossa olen lähes koko lapsuuteni asunut, varttunut ja kouluni käynyt lukioon asti.
sme: Mus leat nana ruohttasat Avvilii ja Anára gildii, gos lean orron masá olles mánnávuođa, bajásšaddan ja vázzán skuvllaid logahaga rádjai.

source: Tuona aikana ei saamelaisuus minuun kuitenkaan siirtynyt millään lailla.
sme: Duon áigge ii sápmelašvuohta goittotge sirdásan munnje mange láhkai.

source: Olen aina tiennyt olevani kolttasaamelainen, mutten sen merkitystä.
sme: Lean álot diehtán ahte lean nuortalaš, muhto in dan mearkkašumi.

source: Äidinkielenä puhun suomea ja kolttaa kuulin vain ja ainoastaan mummoni suusta.
sme: Eatnigiellan hálan suomagiela ja nuortalašgiela gullen dušše beare iežan áhku njálmmis.

source: Vasta kun muutin korkeakouluopintojen perässä Tornioon, aloin etsiä mahdollisuuksia oppia koltankieltä ja tutustua jo miltei unohdettuun kulttuuriin.
sme: Easkka dalle go fárrejin allaskuvlaoahpuid maŋis Tornioi, ohcagohten vejolašvuođaid oahppat nuortalašgiela ja oahpásmuvvat juo masá healbaduvvon kultuvrii.

source: Aloitan syksyllä 2013 kolmannen vuoteni Kemi-Tornion Ammattikorkeakoulussa viestinnän linjalla, reilun vuoden päästä valmistun medianomiksi, toimittajaksi.
sme: Álggahan čakčat 2013 goalmmát jagi Kemi-Tornio Ámmátallaskuvllas kommunikašuvnna suorggis ja sullii jagi geahčen gárvvásmuvan medianoman, doaimmaheaddjin.

source: Haaveenani on tulevaisuudessa oppia koltansaame niin hyvin, että voin työssäni käyttää pääsääntöisesti kolttaa ja siirtää sen myös omille lapsilleni.
sme: Mu niehkun lea boahttevuođas oahppat nuortalašgiela nu bures, ahte sáhtán iežan barggus geavahit beaivválaččat nuortalašgiela ja sirdit dan maiddái iežan mánáide.

source: Henkilökohtaisesti itselläni kesti 19 vuotta ennen kuin tiedostin omat saamelaisjuureni.
sme: Persovnnalaččat mus ádjánii 19 jagi ovdalgo áddejin iežan sámeruohttasiid.

source: Koska kieli ja kulttuuri eivät ole ikinä minulle luonnostaan siirtyneet, olen kokenut paljon sisäistä kamppailua siitä, voinko edes kutsua itseäni kolttasaamelaiseksi.
sme: Daningo giella ja kultuvrra eai leat goassige sirdásan munnje lunddolaččat, lean vásihan ollu siskkáldas dáistaleami das, ahte sáhtángo oba gohčodit iežan nuortalažžan.

source: Tähän varmaan vaikuttaa se, ettei saamelaisuus näy minussa ulospäin, paitsi vasta sitten, kun puen oman kolttapukuni ylleni.
sme: Dása várra váikkuha dat, ahte sámevuohta ii oidno mus olggosguvlui easkkago dalle go cokkan iežan gávtti badjelii.

source: Saamelaisuus, ja etenkin kolttasaamelaisuus merkitsee minulle tätä nykyä ennen kaikkea juuria – tietoutta siitä kuka on ja mistä tulee.
sme: Sápmelašvuohta, ja earenoamážit nuortalašvuohta mearkkaša munnje dán áiggi vuosttažettiinge diđolašvuođa dan birra gii mun lean ja gos boađán.

source: Minulta löytyy uskoa siihen, että tulevien vuosien aikana asiat tulevat paranemaan saamelaisasioiden, etenkin saamenkielien kohdalla.
sme: Mus gávdno jáhkku dasa, ahte boahttevaš jagiid áigge áššit bohtet buorránit sámeáššiid, eandaliige sámegielaid hárrái.

source: Jokaisesta vain on löydyttävä motivaatio sekä suuri halu henkilökohtaisen kielityön eteen, sillä tällä hetkellä kielen elpyminen on osittain kiinni myös vieraana kielenä osaavista koltansaamen puhujista.
sme: Juohkehaččas galgá dušše gávdnot motivašuvdna ja stuorra beroštupmi persovnnalaš giellabarggu ovdii, danin go dál giela ealáskahttin lea gitta maiddái sis, geat hállet nuortalašgiela vieris giellan
